tap "apple/apple"
tap "hashicorp/tap"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ringohub/redis-cli"
tap "tabbyml/tabby"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Fulltext search engine and column store
brew "groonga"
# Apache HTTP server
brew "httpd"
# Website copier/offline browser
brew "httrack"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# LLM inference in C/C++
brew "llama.cpp"
# Utility for directing compilation
brew "make"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Internet file retriever
brew "wget"
# Packer
brew "hashicorp/tap/packer"
# Window manager that organizes desktop applications into predefined zones
cask "bentobox"
# Workflow and Decision Automation Platform
cask "camunda-modeler"
# Keyboard customiser
cask "karabiner-elements"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Handy utility to manage and customize the notch area
cask "notchnook"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
# OpenJDK distribution from Azul
cask "zulu@8"
vscode "42crunch.vscode-openapi"
vscode "a-h.templ"
vscode "angular.ng-template"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "ggml-org.llama-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ihuke.devserver"
vscode "jinliming2.vscode-go-template"
vscode "johnpapa.angular2"
vscode "miragon-gmbh.vs-code-bpmn-modeler"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "msjsdiag.vscode-react-native"
vscode "neverik.go-critic"
vscode "nrwl.angular-console"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ryuta46.multi-command"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vue.volar"
